mentatpsi/Microchip/Microchip/Graphics/GDD/Default_Template/Configs/HWP_MEB_PIC32_GP_SK_8PMP.h
		}
		
		extern inline void __attribute__((always_inline)) TurnLEDAllOff(void)
		{
		      PORTClearBits(IOPORT_D, BIT_1);
		      PORTClearBits(IOPORT_D, BIT_2);
		      PORTClearBits(IOPORT_D, BIT_3);
		      PORTClearBits(IOPORT_C, BIT_1);
		      PORTClearBits(IOPORT_C, BIT_2);
		
		}
	#endif // #ifdef (__PIC32MX__)
	
	#if defined(__dsPIC33E__) || defined (__PIC24E__)
	
		/*********************************************************************
		* Configuration for the CPLD
		*********************************************************************/
		#ifdef USE_16BIT_PMP
		#define GRAPHICS_HW_CONFIG     CPLD_GFX_CONFIG_16BIT
		#else
		#define GRAPHICS_HW_CONFIG     CPLD_GFX_CONFIG_8BIT
		#endif
		
		
		#if defined (USE_XC2C64A)
			// If using the CPLD.
			 #define BIT_15                       (1 << 15)
			 #define BIT_14                       (1 << 14)
			 #define BIT_13                       (1 << 13)
			 #define BIT_12                       (1 << 12)
			 #define BIT_11                       (1 << 11)
			 #define BIT_10                       (1 << 10)
			 #define BIT_9                        (1 << 9)
			 #define BIT_8                        (1 << 8)
			 #define BIT_7                        (1 << 7)
			 #define BIT_6                        (1 << 6)
			 #define BIT_5                        (1 << 5)
			 #define BIT_4                        (1 << 4)
			 #define BIT_3                        (1 << 3)
			 #define BIT_2                        (1 << 2)
			 #define BIT_1                        (1 << 1)
			 #define BIT_0                        (1 << 0)
			 
			typedef	unsigned char		__uint8_t;
			#define	uint8_t		__uint8_t
		
			 typedef struct
			{
				volatile unsigned int	tris;
				volatile unsigned int	port;					
				volatile unsigned int	lat;					
				volatile unsigned int	odc;
				volatile unsigned int	cnen;
				volatile unsigned int	cnpu;
				volatile unsigned int	cnpd;
				volatile unsigned int	ansel;					
			}PortRegMap;	// port registers layout
				
			#define IOPORT_A (unsigned int*)&TRISA
			#define IOPORT_B (unsigned int*)&TRISB
			#define IOPORT_C (unsigned int*)&TRISC
			#define IOPORT_D (unsigned int*)&TRISD
			#define IOPORT_E (unsigned int*)&TRISE
			#define IOPORT_F (unsigned int*)&TRISF 
			#define IOPORT_G (unsigned int*)&TRISG
		
			
			extern inline void __attribute__((always_inline)) PORTSetBits(unsigned int *regBase, unsigned int bits)
			{
				PortRegMap *PortMap = (PortRegMap*)regBase;
				PortMap->lat |= bits;			
			}	
			
			extern inline void __attribute__((always_inline)) PORTClearBits(unsigned int *regBase, unsigned int bits)
			{
				PortRegMap *PortMap = (PortRegMap*)regBase;
				PortMap->lat &= ~bits;		
					
			}	
			
			
			extern inline unsigned int __attribute__((always_inline)) PORTReadBits(unsigned int *regBase, unsigned int bits)
			{
				PortRegMap *PortMap = (PortRegMap*)regBase;
				return(PortMap->lat & bits);
			}	
			
			extern inline void __attribute__((always_inline)) PORTSetPinsDigitalOut(unsigned int *regBase, unsigned int bits)
			{
				PortRegMap *PortMap = (PortRegMap*)regBase;
				PortMap->tris &= ~bits;								
			}			
			
					
		
		#endif
	
	#endif // #ifdef (__dsPIC33E__) || (__PIC24E__)
	
	
#endif // #ifdef (MEB_BOARD)

#endif // __HARDWARE_PROFILE_H




